
## :x: Apply Failed (parser-graphql-wrapper-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/45534)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.pagerduty_escalation_policy.mozilla_sre_escalation_policy: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/ParserGraphQLWrapper-Dev]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1037197018]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=parsergraphqlwrapper-dev-app]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/409aa0c9-9b53-4a2a-a8d6-8b49281cac76]
data.aws_kms_alias.kms_alias: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/ParserGraphQLWrapper-Dev/ecs/aws-otel-collector]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=410318598490]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:ParserGraphQLWrapper-Dev-Infrastructure-Alarm-Non-Critical]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=410318598490]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ParserGraphQLWrapper-Dev/ecs/app]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z0900973FLZRJ2HQZDWG]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:ParserGraphQLWrapper-Dev-Infrastructure-Alarm-Critical]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=8424de1c-1803-497c-af5a-cffed1b6bfba:ParserGraphQLWrapper-Dev-ECS]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ParserGraphQLWrapper-Dev-TaskExecutionRole]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ParserGraphQLWrapper-Dev-TaskRole]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ParserGraphQLWrapper-Dev-ECSCodeDeployRole]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::410318598490:policy/ParserGraphQLWrapper-Dev-TaskRolePolicy]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=ZCSIDA846KWLN]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=parsergraphqlwrapper-dev-app]
data.aws_vpc.pocket-vpc_2587E211: Reading...
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/ecddf7472b19a2fb34f7e1aaf9629b12b66c70ec]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z0900973FLZRJ2HQZDWG__3a16661635f4909422f1987c4f65b602.parser-graphql-wrapper.getpocket.dev._CNAME]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ParserGraphQLWrapper-Dev-TaskExecutionRole-2021011400020040940000000a]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=ZCSIDA846KWLN_parser-graphql-wrapper.getpocket.dev_NS]
data.pagerduty_escalation_policy.mozilla_sre_escalation_policy: Read complete after 1s [id=PLPWYPC]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ParserGraphQLWrapper-Dev-ECSCodeDeployRole-20210114000200280800000008]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PSW2G2T]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=POJEFQ3]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2023-02-28 00:12:09.412 +0000 UTC]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ParserGraphQLWrapper-Dev-TaskRole-20210114000200324600000009]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-012481e83ffa5e152]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=PX1M6TP]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PTSB5DM]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/PARSER20210114000159900000000004/7ee50d61e7e0e5b6]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/PARSER20210114000159891900000001/522f28eb59d027b0]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 1s [id=vpc-012481e83ffa5e152]
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-00dbbf83c2b6d07cf]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=PABN75C]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PENY7I2]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_vpc.dev-shares-aurora_vpc_134DBEAF: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Reading...
data.aws_vpc.redis_vpc_45DE3471: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:ParserGraphQLWrapper-Dev-Infrastructure-Alarm-Critical:13a62f5e-ec6e-4261-a188-e29b14c516cb]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:ParserGraphQLWrapper-Dev-Infrastructure-Alarm-Non-Critical:ffd0f937-ce11-4a12-b319-0b8d0997b738]
aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2: Refreshing state... [id=parsergraphqlwrapper-dev-elasticachesubnetgroup]
aws_db_subnet_group.dev-shares-aurora_rds_subnet_group_A970DD84: Refreshing state... [id=parserwrapperapidev-pocketshares20230413154452250800000001]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/PARSER2021011400020170190000000c/c5115008d2374ce4]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0df6ca54b679f703c]
data.aws_vpc.dev-shares-aurora_vpc_134DBEAF: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_security_group.dev-shares-aurora_rds_security_group_6C330A23: Refreshing state... [id=sg-0c71fbafcdbfbd8e4]
data.aws_vpc.redis_vpc_45DE3471: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_security_group.redis_elasticache_security_group_24BFB83E: Refreshing state... [id=sg-01cc47f926fd5fc1d]
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/PARSER2021011400020170190000000c/c5115008d2374ce4/4b8d211154ce9f8d]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/PARSER2021011400020170190000000c/c5115008d2374ce4/6591a93f9e916705]
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Refreshing state... [id=ParserGraphQLWrapper-Dev-Alarm-HTTPResponseTime]
aws_rds_cluster.dev-shares-aurora_rds_cluster_9BD2B0A0: Refreshing state... [id=parserwrapperapidev-pocketshares20230413154454897200000003]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z0900973FLZRJ2HQZDWG_parser-graphql-wrapper.getpocket.dev_A_1]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=ParserGraphQLWrapper-Dev-Alarm-HTTPTarget5xxErrorRate]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ParserGraphQLWrapper-Dev]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Refreshing state... [id=parsergraphqlwrapper-dev]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=55356fb215e4df2ba6f8e3f39c13613415b6e504]
aws_secretsmanager_secret.dev-shares-aurora_rds_secret_9627C86B: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserWrapperApiDev-PocketShares/parserwrapperapidev-pocketshares20230413154454897200000003-cJstJi]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/PARSER2021011400020170190000000c/c5115008d2374ce4/4b8d211154ce9f8d/60f771aad429efa4]
aws_secretsmanager_secret_version.dev-shares-aurora_rds_secret_version_C4B9CB93: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserWrapperApiDev-PocketShares/parserwrapperapidev-pocketshares20230413154454897200000003-cJstJi|514E3B25-7434-4FA1-9356-17633566A695]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=2223975898]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::410318598490:policy/ParserGraphQLWrapper-Dev-TaskExecutionRolePolicy]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/ParserGraphQLWrapper-Dev/ParserGraphQLWrapper-Dev]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ParserGraphQLWrapper-Dev-TaskExecutionRole-2021011400020043900000000b]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=eb4a7c81-f259-4cc4-9c15-007d79220770]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ParserGraphQLWrapper-Dev/ParserGraphQLWrapper-Dev]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ParserGraphQLWrapper-Dev]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ParserGraphQLWrapper-Dev-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ParserGraphQLWrapper-Dev-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ParserGraphQLWrapper-Dev Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ParserGraphQLWrapper-Dev Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:410318598490:task-definition/ParserGraphQLWrapper-Dev:125" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:410318598490:task-definition/ParserGraphQLWrapper-Dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu                    = 0
                  - environment            = [
                      - {
                          - name  = "ENVIRONMENT"
                          - value = "development"
                        },
                      - {
                          - name  = "OTLP_COLLECTOR_HOST"
                          - value = "localhost"
                        },
                      - {
                          - name  = "REDIS_PRIMARY_ENDPOINT"
                          - value = "parsergraphqlwrapper-dev.n7e2yl.ng.0001.use1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_READER_ENDPOINT"
                          - value = "parsergraphqlwrapper-dev-ro.n7e2yl.ng.0001.use1.cache.amazonaws.com"
                        },
                    ]
                  - essential              = true
                  - healthCheck            = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:4001/.well-known/apollo/server-health || exit 1",
                        ]
                      - interval    = 5
                      - retries     = 3
                      - startPeriod = 30
                      - timeout     = 5
                    }
                  - image                  = "410318598490.dkr.ecr.us-east-1.amazonaws.com/parsergraphqlwrapper-dev-app:c0f09c0e03108969e2d7c1efba756f32b34ce547"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/ParserGraphQLWrapper-Dev/ecs/app"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "app"
                  - portMappings           = [
                      - {
                          - containerPort = 4001
                          - hostPort      = 4001
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserGraphQLWrapper/Dev/READITLA_DB:host::"
                        },
                      - {
                          - name      = "DB_USERNAME"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserGraphQLWrapper/Dev/READITLA_DB:username::"
                        },
                      - {
                          - name      = "DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserGraphQLWrapper/Dev/READITLA_DB:password::"
                        },
                      - {
                          - name      = "SENTRY_DSN"
                          - valueFrom = "arn:aws:ssm:us-east-1:410318598490:parameter/ParserGraphQLWrapper/Dev/SENTRY_DSN"
                        },
                      - {
                          - name      = "POCKET_SHARES_DATABASE_WRITE_HOST"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserWrapperApi/Dev/POCKET_SHARES:host::"
                        },
                      - {
                          - name      = "POCKET_SHARES_DATABASE_WRITE_USER"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserWrapperApi/Dev/POCKET_SHARES:username::"
                        },
                      - {
                          - name      = "POCKET_SHARES_DATABASE_WRITE_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserWrapperApi/Dev/POCKET_SHARES:password::"
                        },
                      - {
                          - name      = "PARSER_URL"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserWrapperApi/Dev/SECRETS:parser_endpoint::"
                        },
                      - {
                          - name      = "SHORT_PREFIX"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserWrapperApi/Dev/SECRETS:short_prefix::"
                        },
                      - {
                          - name      = "SHORT_PREFIX_SECURE"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserWrapperApi/Dev/SECRETS:short_prefix_secure::"
                        },
                      - {
                          - name      = "SHORT_CODE_CHARS"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ParserWrapperApi/Dev/SECRETS:short_code_chars::"
                        },
                    ]
                  - volumesFrom            = []
                },
              - {
                  - command                = [
                      - "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-otel-collector"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/ParserGraphQLWrapper-Dev/ecs/aws-otel-collector"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "aws-otel-collector"
                  - portMappings           = [
                      - {
                          - containerPort = 4138
                          - hostPort      = 4138
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4137
                          - hostPort      = 4137
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:410318598490:secret:Shared/DockerHub"
                    }
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "ParserGraphQLWrapper-Dev" -> (known after apply)
      ~ revision                 = 125 -> (known after apply)
        tags                     = {
            "environment" = "Dev"
            "service"     = "ParserGraphQLWrapper"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF will be created
  + resource "aws_elasticache_serverless_cache" "serverless_redis_elasticache_serverless_356B3FAF" {
      + arn                      = (known after apply)
      + create_time              = (known after apply)
      + daily_snapshot_time      = (known after apply)
      + description              = "Redis for ParserGraphQLWrapper-Dev"
      + endpoint                 = (known after apply)
      + engine                   = "redis"
      + full_engine_version      = (known after apply)
      + id                       = (known after apply)
      + major_engine_version     = "7.0"
      + name                     = "ParserGraphQLWrapper-Dev"
      + reader_endpoint          = (known after apply)
      + security_group_ids       = [
          + (known after apply),
        ]
      + snapshot_retention_limit = (known after apply)
      + status                   = (known after apply)
      + subnet_ids               = [
          + "subnet-04478ac1c55709b1f",
          + "subnet-07854aac95d07bb16",
          + "subnet-0a6c00fa564f97b10",
          + "subnet-0eb99fe10e08d5d96",
        ]
      + tags                     = {
          + "environment" = "Dev"
          + "service"     = "ParserGraphQLWrapper"
        }
      + tags_all                 = {
          + "environment" = "Dev"
          + "service"     = "ParserGraphQLWrapper"
        }
    }

  # aws_security_group.serverless_redis_elasticache_security_group_31FA49DF will be created
  + resource "aws_security_group" "serverless_redis_elasticache_security_group_31FA49DF" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "ParserGraphQLWrapper-Dev"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "environment" = "Dev"
          + "service"     = "ParserGraphQLWrapper"
        }
      + tags_all               = {
          + "environment" = "Dev"
          + "service"     = "ParserGraphQLWrapper"
        }
      + vpc_id                 = "vpc-012481e83ffa5e152"
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ParserGraphQLWrapper-Dev]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_security_group.serverless_redis_elasticache_security_group_31FA49DF: Creating...
aws_security_group.serverless_redis_elasticache_security_group_31FA49DF: Creation complete after 2s [id=sg-0a389fa95674bfdc4]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Creating...
╷
│ Error: creating Amazon ElastiCache Serverless Cache (ParserGraphQLWrapper-Dev): operation error ElastiCache: CreateServerlessCache, https response error StatusCode: 400, RequestID: 8fd22498-91ec-4af4-a4b2-fc97b10a87c4, InvalidParameterCombination: Specified engine does not support major engine version (7.0).
│ 
│   with aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF,
│   on cdk.tf.json line 1402, in resource.aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF:
│ 1402:       }
│ 
│ operation error ElastiCache: CreateServerlessCache, https response error
│ StatusCode: 400, RequestID: 8fd22498-91ec-4af4-a4b2-fc97b10a87c4,
│ InvalidParameterCombination: Specified engine does not support major engine
│ version (7.0).
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"f8bcf421-7267-4c87-b53a-08a785faccc2","JobName":"parser-graphql-wrapper_infrastructure_apply_dev","PRNumber":162,"Program":"tfcmt","SHA1":"66fa9cefa772c094b530c4499f6a6c86b61c319d","Target":"parser-graphql-wrapper-cdk-dev","Vars":{}} -->